#[allow(dead_code)]

/**
 * 间接访问变量时，无法在分支中使用该变量而不重新绑定。match 提供了 @ 符号，用于将值绑定到名称
 */
 // 一个返回 `u32` 的 `age` 函数。
fn age() -> u32 {
    15
}

fn main() {
    println!("告诉我你是什么类型的人");

    match age() {
        0             => println!("我还没有过第一个生日"),
        // 我们可以直接 `match` 1 ..= 12，但那样的话如何确定
        // 孩子的确切年龄呢？
        // 可以 `match` n 并使用 `if` 守卫，但这并不是
        // 穷尽性检查。
        // （虽然在这种情况下无关紧要，因为底部有一个
        // "兜底" 模式）
        // 因此，将 1 ..= 12 序列绑定到 `n`。
        // 现在可以报告年龄了。
        n @ 1  ..= 12 => println!("我是 {:?} 岁的儿童", n),
        n @ 13 ..= 19 => println!("我是 {:?} 岁的青少年", n),
        // 类似地，当匹配多个值时，可以进行绑定。
        // n @ (1 | 7 | 15 | 13) => println!("我是 {:?} 岁的青少年", n),
        // 没有绑定。直接返回结果。
        n             => println!("我是 {:?} 岁的成年人", n),
    }
}