/**
 * Rust 中的变量不仅仅是在栈上保存数据：它们还拥有资源，
 * 例如 Box<T> 拥有堆上的内存。Rust 强制执行 RAII（资源获取即初始化），
 * 因此每当一个对象离开作用域时，它的析构函数就会被调用，它拥有的资源也会被释放。
 */

 // raii.rs
fn create_box() {
    // 在堆上分配一个整数
    let _box1 = Box::new(3i32);

    // `_box1` 在此处被销毁，内存被释放
}

fn main() {
    // 在堆上分配一个整数
    let _box2 = Box::new(5i32);

    // 一个嵌套的作用域：
    {
        // 在堆上分配一个整数
        let _box3 = Box::new(4i32);

        // `_box3` 在此处被销毁，内存被释放
    }

    // 创建大量的 box（仅为演示）
    // 无需手动释放内存！
    for _ in 0u32..1_000 {
        create_box();
    }

    // `_box2` 在此处被销毁，内存被释放
}